# Задача «Дробная часть»
# Дано положительное действительное число X. Выведите его дробную часть.
x = float(input())
print(round(x - int(x),3))
