#Задача «Автопробег»
#За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров? Программа получает на вход числа n и m.
v = int(input())
u = int(input())
print(ceil(u / v))
