#Задача «Число десятков»
#Дано натуральное число. Найдите число десятков в его десятичной записи.
number = int(input())
print(number // 10)
